In [1]:
import pandas as pd

```bash
pip install sqlalchemy psycopg2-binary 
```

In [2]:
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [4]:
db = engine.connect()

In [5]:
query = """
SELECT 1 as number;
"""

pd.read_sql(query, con=engine)

   number
0       1

In [6]:
query = """
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
"""

pd.read_sql(query, con=engine)

,schemaname,tablename,tableowner,tablespace,hasindexes,hasrules,hastriggers,rowsecurity
0,public,yellow_tripdata_trip,root,None,False,False,False,False

In [40]:
from sqlalchemy import text
query = text("""
DROP TABLE IF EXISTS yellow_tripdata_trip_1;
""")

db.execute(query)
db.commit()

In [11]:
df = pd.read_parquet('/home/opc/data/yellow_tripdata_2024-01.parquet')

In [28]:
df.to_sql(name='yellow_tripdata_trip', if_exists='replace', con=engine, index=False, chunksize=10000)

296624

In [7]:
query = """
SELECT * FROM yellow_tripdata_trip limit 100
"""

#passenger_count,
        #trip_distance,
        #store_and_fwd_flag,
        #payment_type,
        #fare_amount,
        #extra,
        #mta_tax,
        #tip_amount,
        #total_amount

df = pd.read_sql(query, con=engine)

```sql
SELECT *
FROM pg_catalog.pg_tables
WHERE schemaname != 'pg_catalog' AND 
    schemaname != 'information_schema';
```

Source: https://www.postgresqltutorial.com/postgresql-show-tables/

In [9]:
df.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount,congestion_surcharge,Airport_fee
0,2,2024-01-02 13:50:11,2024-01-02 13:58:23,1.0,1.40,1.0,N,79,234,1,10.0,0.0,0.5,2.80,0.0,1.0,16.80,2.5,0.0
1,2,2024-01-02 13:38:58,2024-01-02 14:01:00,4.0,2.41,1.0,N,163,230,2,18.4,0.0,0.5,0.00,0.0,1.0,22.40,2.5,0.0
2,2,2024-01-02 13:12:27,2024-01-02 13:25:00,1.0,0.48,1.0,N,237,163,1,11.4,0.0,0.5,4.62,0.0,1.0,20.02,2.5,0.0
3,2,2024-01-02 13:30:30,2024-01-02 13:43:21,1.0,1.88,1.0,N,161,113,1,13.5,0.0,0.5,3.50,0.0,1.0,21.00,2.5,0.0
4,1,2024-01-02 13:31:02,2024-01-02 13:46:33,1.0,2.70,1.0,N,163,246,1,14.9,2.5,0.5,2.00,0.0,1.0,20.90,2.5,0.0